TestingTool_3-0/src/InformationRegisters/НастройкаРабочегоМестаНачальнойСтранцы/НастройкаРабочегоМестаНачальнойСтранцы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаРабочегоМестаНачальнойСтранцы</name>
  <resources>
    <name>ДополнительнаяОбработкаДляРабочегоМеста</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
    </type>
  </resources>
  <resources>
    <name>НеСбрасыватьНастройкиНачальнойСтраницы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеОткрыватьРабочееМестоПриСтарте</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestingTool_3-0/src/CommonModules/ОсновноеРабочееМестоСервер/Module.bsl
Процедура СброситьНастройкиНачальнойСтраницыПриВыбранномОсновномРабочемМесте() Экспорт
	
	Если СбрасыватьНастройкиПользователя() Тогда
		НастройкиНачальнойСтраницы = новый НастройкиНачальнойСтраницы;
		СоставФорм = новый СоставФормНачальнойСтраницы;
		
		НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы",,НастройкиНачальнойСтраницы);
	КонецЕсли;
	
КонецПроцедуры

Функция УстановленоОсновноеРабочееМесто() Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НастройкаРабочегоМестаНачальнойСтранцы.Пользователь,
	|	НастройкаРабочегоМестаНачальнойСтранцы.ДополнительнаяОбработкаДляРабочегоМеста
	|ИЗ
	|	РегистрСведений.НастройкаРабочегоМестаНачальнойСтранцы КАК НастройкаРабочегоМестаНачальнойСтранцы
	|ГДЕ
	|	НастройкаРабочегоМестаНачальнойСтранцы.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь",Пользователи.ТекущийПользователь());
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция ОткрыватьОсновноеРабочееМестоПриЗапускеСистемы() Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НастройкаРабочегоМестаНачальнойСтранцы.Пользователь,
	|	НастройкаРабочегоМестаНачальнойСтранцы.ДополнительнаяОбработкаДляРабочегоМеста
	|ИЗ
	|	РегистрСведений.НастройкаРабочегоМестаНачальнойСтранцы КАК НастройкаРабочегоМестаНачальнойСтранцы
	|ГДЕ
	|	НастройкаРабочегоМестаНачальнойСтранцы.Пользователь = &Пользователь
	|	И НастройкаРабочегоМестаНачальнойСтранцы.НеОткрыватьРабочееМестоПриСтарте = ЛОЖЬ";
	Запрос.УстановитьПараметр("Пользователь",Пользователи.ТекущийПользователь());
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция СбрасыватьНастройкиПользователя() Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НастройкаРабочегоМестаНачальнойСтранцы.Пользователь,
	|	НастройкаРабочегоМестаНачальнойСтранцы.ДополнительнаяОбработкаДляРабочегоМеста
	|ИЗ
	|	РегистрСведений.НастройкаРабочегоМестаНачальнойСтранцы КАК НастройкаРабочегоМестаНачальнойСтранцы
	|ГДЕ
	|	НастройкаРабочегоМестаНачальнойСтранцы.Пользователь = &Пользователь
	|	И НастройкаРабочегоМестаНачальнойСтранцы.НеСбрасыватьНастройкиНачальнойСтраницы = ЛОЖЬ";
	Запрос.УстановитьПараметр("Пользователь",Пользователи.ТекущийПользователь());
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции
